# PANDAS SERIES

In [1]:
import pandas as pd

In [3]:
# Create pandas series
a = pd.Series([1,2,3,4,5])

In [4]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# check data type
a.dtype

dtype('int64')

In [7]:
type(a)

pandas.core.series.Series

In [8]:
# Accesing elemnt of series
a[3]

4

In [9]:
a[[2,3,4]]

2    3
3    4
4    5
dtype: int64

In [10]:
a = pd.Series(['a', 'b', 'c'])

In [11]:
a

0    a
1    b
2    c
dtype: object

In [12]:
# Get continuous Date 
a = pd.date_range(start='01-01-2018', end= '23-05-2018')

In [13]:
a

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2018-05-14', '2018-05-15', '2018-05-16', '2018-05-17',
               '2018-05-18', '2018-05-19', '2018-05-20', '2018-05-21',
               '2018-05-22', '2018-05-23'],
              dtype='datetime64[ns]', length=143, freq='D')

In [14]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

# PANDAS DATAFRAME

In [15]:
# Create pandas dataframe using list
import numpy as np

In [22]:
temp = np.random.randint(size = 20, low=20, high=100)
name = np.random.choice(['Abhay', 'Teclov', 'Geekshub', 'Ankit'], 20)
random = np.random.choice([10, 11, 13, 12, 14], 20)

In [25]:
a = list(zip(temp, name, random))

In [26]:
a

[(99, 'Geekshub', 11),
 (38, 'Ankit', 11),
 (54, 'Teclov', 12),
 (56, 'Teclov', 13),
 (34, 'Ankit', 10),
 (56, 'Teclov', 12),
 (99, 'Ankit', 11),
 (55, 'Teclov', 14),
 (53, 'Abhay', 10),
 (89, 'Ankit', 13),
 (78, 'Abhay', 14),
 (79, 'Abhay', 10),
 (93, 'Geekshub', 14),
 (38, 'Ankit', 10),
 (97, 'Abhay', 13),
 (78, 'Ankit', 14),
 (51, 'Ankit', 10),
 (81, 'Teclov', 13),
 (36, 'Teclov', 11),
 (43, 'Ankit', 13)]

In [28]:
df = pd.DataFrame(data=a, columns=['temp', 'name', 'random'])

In [29]:
df

    temp      name  random
0     99  Geekshub      11
1     38     Ankit      11
2     54    Teclov      12
3     56    Teclov      13
4     34     Ankit      10
5     56    Teclov      12
6     99     Ankit      11
7     55    Teclov      14
8     53     Abhay      10
9     89     Ankit      13
10    78     Abhay      14
11    79     Abhay      10
12    93  Geekshub      14
13    38     Ankit      10
14    97     Abhay      13
15    78     Ankit      14
16    51     Ankit      10
17    81    Teclov      13
18    36    Teclov      11
19    43     Ankit      13

In [91]:
# Create pandas dataframe using python dict
df = pd.DataFrame({'temp': temp, 'name': name, 'random': random})

In [34]:
df

    temp      name  random
0     99  Geekshub      11
1     38     Ankit      11
2     54    Teclov      12
3     56    Teclov      13
4     34     Ankit      10
5     56    Teclov      12
6     99     Ankit      11
7     55    Teclov      14
8     53     Abhay      10
9     89     Ankit      13
10    78     Abhay      14
11    79     Abhay      10
12    93  Geekshub      14
13    38     Ankit      10
14    97     Abhay      13
15    78     Ankit      14
16    51     Ankit      10
17    81    Teclov      13
18    36    Teclov      11
19    43     Ankit      13

# Operations on DataFrame

In [37]:
# Show top 5 head/tail rows
df.head()

   temp      name  random
0    99  Geekshub      11
1    38     Ankit      11
2    54    Teclov      12
3    56    Teclov      13
4    34     Ankit      10

In [39]:
df.tail()

    temp    name  random
15    78   Ankit      14
16    51   Ankit      10
17    81  Teclov      13
18    36  Teclov      11
19    43   Ankit      13

In [40]:
# Check the shape of df
df.shape

(20, 3)

In [41]:
# Check the columns
df.columns

Index(['temp', 'name', 'random'], dtype='object')

In [44]:
# Select based on column name
df.name # or df["name"]

0     Geekshub
1        Ankit
2       Teclov
3       Teclov
4        Ankit
5       Teclov
6        Ankit
7       Teclov
8        Abhay
9        Ankit
10       Abhay
11       Abhay
12    Geekshub
13       Ankit
14       Abhay
15       Ankit
16       Ankit
17      Teclov
18      Teclov
19       Ankit
Name: name, dtype: object

In [48]:
# Summary Statistics of numeric column in df
df.describe()

           temp     random
count  20.00000  20.000000
mean   65.35000  11.950000
std    22.88478   1.538112
min    34.00000  10.000000
25%    49.00000  10.750000
50%    56.00000  12.000000
75%    83.00000  13.000000
max    99.00000  14.000000

In [50]:
# All the information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
temp      20 non-null int64
name      20 non-null object
random    20 non-null int64
dtypes: int64(2), object(1)
memory usage: 560.0+ bytes

In [54]:
# dataframe to numpy array
df.values

array([[99, 'Geekshub', 11],
       [38, 'Ankit', 11],
       [54, 'Teclov', 12],
       [56, 'Teclov', 13],
       [34, 'Ankit', 10],
       [56, 'Teclov', 12],
       [99, 'Ankit', 11],
       [55, 'Teclov', 14],
       [53, 'Abhay', 10],
       [89, 'Ankit', 13],
       [78, 'Abhay', 14],
       [79, 'Abhay', 10],
       [93, 'Geekshub', 14],
       [38, 'Ankit', 10],
       [97, 'Abhay', 13],
       [78, 'Ankit', 14],
       [51, 'Ankit', 10],
       [81, 'Teclov', 13],
       [36, 'Teclov', 11],
       [43, 'Ankit', 13]], dtype=object)

# INDEXS

In [57]:
# Make temp as Index
df.set_index("temp", inplace=True) # inplace = True to make this change permanent

In [58]:
# Sort based on index
df.sort_index(axis=0, ascending=False)

          name  random
temp
99    Geekshub      11
99       Ankit      11
97       Abhay      13
93    Geekshub      14
89       Ankit      13
81      Teclov      13
79       Abhay      10
78       Ankit      14
78       Abhay      14
56      Teclov      12
56      Teclov      13
55      Teclov      14
54      Teclov      12
53       Abhay      10
51       Ankit      10
43       Ankit      13
38       Ankit      11
38       Ankit      10
36      Teclov      11
34       Ankit      10

In [60]:
# Sort based on column
df.sort_values(by="random", ascending=False)

          name  random
temp
78       Abhay      14
55      Teclov      14
78       Ankit      14
93    Geekshub      14
81      Teclov      13
97       Abhay      13
89       Ankit      13
43       Ankit      13
56      Teclov      13
56      Teclov      12
54      Teclov      12
99       Ankit      11
38       Ankit      11
36      Teclov      11
99    Geekshub      11
53       Abhay      10
79       Abhay      10
38       Ankit      10
34       Ankit      10
51       Ankit      10

In [63]:
# Drop a column
df.drop(["random"], axis=1)

          name
temp
99    Geekshub
38       Ankit
54      Teclov
56      Teclov
34       Ankit
56      Teclov
99       Ankit
55      Teclov
53       Abhay
89       Ankit
78       Abhay
79       Abhay
93    Geekshub
38       Ankit
97       Abhay
78       Ankit
51       Ankit
81      Teclov
36      Teclov
43       Ankit

# ILOC and LOC

In [66]:
# Get 0th and 1st Row
df.iloc[[0,1]]

          name  random
temp
99    Geekshub      11
38       Ankit      11

In [69]:
# Select 1st and 2nd Row and Random Column
df.iloc[1:3, 1]

temp
38    11
54    12
Name: random, dtype: int64

In [71]:
# Print rows based on True or False
df.iloc[[True, True,False,True]]

          name  random
temp
99    Geekshub      11
38       Ankit      11
56      Teclov      13

In [72]:
df.iloc[0, :]

name      Geekshub
random          11
Name: 99, dtype: object

In [77]:
# Loc looks for value in Index
df.loc[38]

       name  random
temp
38    Ankit      11
38    Ankit      10

In [78]:
# Multiple Index
df.loc[[99, 38]]

          name  random
temp
99    Geekshub      11
99       Ankit      11
38       Ankit      11
38       Ankit      10

In [80]:
# Select index 99 and 38 and print all the columns from name to random
df.loc[[99, 38], 'name': 'random']

          name  random
temp
99    Geekshub      11
99       Ankit      11
38       Ankit      11
38       Ankit      10

In [84]:
# Based on Boolean values
df.loc[[True,True, False, True]]

          name  random
temp
99    Geekshub      11
38       Ankit      11
56      Teclov      13

In [86]:
# Condition in loc
df.loc[df.random >13]

          name  random
temp
55      Teclov      14
78       Abhay      14
93    Geekshub      14
78       Ankit      14

In [88]:
df.loc[(df.random > 13) | (df.random == 10)]

          name  random
temp
34       Ankit      10
55      Teclov      14
53       Abhay      10
78       Abhay      14
79       Abhay      10
93    Geekshub      14
38       Ankit      10
78       Ankit      14
51       Ankit      10

# PANDAS and FILE HANDLING

In [113]:
df1 = pd.read_csv("./weather_data.csv")

In [114]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [120]:
# Save to Excel file , requires openpyxl package
df1.to_excel('df_excel.xlsx', sheet_name='weather_data')

In [121]:
# Read xlsx file in df, requires package xlrd
df2 = pd.read_excel('df_excel.xlsx')

In [122]:
# Save as csv File
df2.to_csv("file.csv") # It will store the index

In [123]:
df2.to_csv("file_no_index.csv", index=False) # It will not save index in CSV

# MERGING and CONCAT DATAFRAMES

In [98]:
d1 = pd.DataFrame([['a', 1], ['b', 2]], columns=['col1', 'number'])
d2 = pd.DataFrame([['c', 3, 'lion'], ['d', 4, 'tiger']], columns=['letter', 'number', 'animal'])

In [99]:
d1

  col1  number
0    a       1
1    b       2

In [100]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [105]:
# Concat row wise
pd.concat([d1, d2], axis=0, sort=True)

  animal col1 letter  number
0    NaN    a    NaN       1
1    NaN    b    NaN       2
0   lion  NaN      c       3
1  tiger  NaN      d       4

In [107]:
# Conacat with new indexing
pd.concat([d1, d2], axis=0, ignore_index=True, sort=False)

  col1  number letter animal
0    a       1    NaN    NaN
1    b       2    NaN    NaN
2  NaN       3      c   lion
3  NaN       4      d  tiger

In [110]:
# Conact with Column
pd.concat([d1,d2], axis=1, sort=False)

  col1  number letter  number animal
0    a       1      c       3   lion
1    b       2      d       4  tiger

# GroupBy

In [124]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [125]:
df2_group = df2.groupby("event")

In [126]:
df2_group

In [128]:
for temp in df2_group:
    print(temp)

('Rain',         day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain)
('Snow',         day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow)
('Sunny',         day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
5  1/6/2017           31          2  Sunny)

In [129]:
df2_group.get_group("Rain")

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain

In [130]:
df2_group.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

In [146]:
# UDF in Pandas
def hot_temp(row):
    return row.temperature + row.windspeed

In [147]:
df2

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

In [149]:
df2["dfs"] = df2.apply(lambda row: hot_temp(row), axis=1)

In [150]:
df2

        day  temperature  windspeed  event  hot_temp  dfs
0  1/1/2017           32          6   Rain      True   38
1  1/2/2017           35          7  Sunny      True   42
2  1/3/2017           28          2   Snow     False   30
3  1/4/2017           24          7   Snow     False   31
4  1/5/2017           32          4   Rain      True   36
5  1/6/2017           31          2  Sunny      True   33

In [151]:
df2["dfs"] = df2.apply(lambda row: row.temperature + row.windspeed , axis=1)

In [152]:
df2

        day  temperature  windspeed  event  hot_temp  dfs
0  1/1/2017           32          6   Rain      True   38
1  1/2/2017           35          7  Sunny      True   42
2  1/3/2017           28          2   Snow     False   30
3  1/4/2017           24          7   Snow     False   31
4  1/5/2017           32          4   Rain      True   36
5  1/6/2017           31          2  Sunny      True   33

In [153]:
df2["jhg"] = df2.temperature + df2.windspeed

In [154]:
df2

        day  temperature  windspeed  event  hot_temp  dfs  jhg
0  1/1/2017           32          6   Rain      True   38   38
1  1/2/2017           35          7  Sunny      True   42   42
2  1/3/2017           28          2   Snow     False   30   30
3  1/4/2017           24          7   Snow     False   31   31
4  1/5/2017           32          4   Rain      True   36   36
5  1/6/2017           31          2  Sunny      True   33   33

# JOINS

In [155]:
d1 = pd.DataFrame({
    "city": ["lucknow", "kanpur", "agra", "delhi"],
    "temperature": [32, 45, 30, 40]
})

In [156]:
d1

      city  temperature
0  lucknow           32
1   kanpur           45
2     agra           30
3    delhi           40

In [157]:
d2 = pd.DataFrame({
    "city": ["delhi", "lucknow", "kanpur"],
    "humidity": [68, 65, 75]
})

In [158]:
d2

      city  humidity
0    delhi        68
1  lucknow        65
2   kanpur        75

In [159]:
df = pd.merge(d1, d2, on="city")

In [160]:
df

      city  temperature  humidity
0  lucknow           32        65
1   kanpur           45        75
2    delhi           40        68

In [161]:
pd.merge(d1, d2, on="city", how="outer")

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

In [162]:
pd.merge(d1, d2, on="city", how="left")

      city  temperature  humidity
0  lucknow           32      65.0
1   kanpur           45      75.0
2     agra           30       NaN
3    delhi           40      68.0

# PIVOTS

In [163]:
df2

        day  temperature  windspeed  event  hot_temp  dfs  jhg
0  1/1/2017           32          6   Rain      True   38   38
1  1/2/2017           35          7  Sunny      True   42   42
2  1/3/2017           28          2   Snow     False   30   30
3  1/4/2017           24          7   Snow     False   31   31
4  1/5/2017           32          4   Rain      True   36   36
5  1/6/2017           31          2  Sunny      True   33   33

In [166]:
df2.pivot_table(values="temperature", index="event", aggfunc="mean") # group by on event, get mean of temperature column

       temperature
event
Rain            32
Snow            26
Sunny           33

In [167]:
df2.pivot_table(columns=["temperature"])

temperature     24     28    31    32    35
dfs             31     30    33    37    42
hot_temp     False  False  True  True  True
jhg             31     30    33    37    42
windspeed        7      2     2     5     7

In [168]:
# get help 
help(df.DataFrame.pivot)

AttributeError: 'DataFrame' object has no attribute 'DataFrame'